app/controllers/api/sauce_companies_controller.rb

SELECT "sauce_companies".* FROM "sauce_companies"
---
  def index
    @companies = SauceCompany.all