app/controllers/api/sauces_controller.rb

  def index
    @sauces = Sauce.all.includes(:company)
---
SELECT "sauces".* FROM "sauces"

  def show
    @sauce = Sauce.find(params[:id])
---
SELECT  "sauces".* FROM "sauces" WHERE "sauces"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def create

    params = sauce_params.permit(:name, :description, :scoville_units, :image_url, :image)
    if sauce_params['company'] == ''
      params['company_id'] = nil
    else
      params['company_id'] = SauceCompany.find_by_name(sauce_params['company']).id
---
SELECT  "sauce_companies".* FROM "sauce_companies" WHERE "sauce_companies"."name" = $1 LIMIT $2  [["name", "TABASCO"], ["LIMIT", 1]]