app/views/api/users/_user.json.jbuilder

INSERT INTO "users" ("username", "email", "session_token", "password_digest", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
json.extract! user, :id, :username, :description, :num_checkins, :num_sauces
json.join_date user.created_at